_org/_posts/kit/2019-03-05-frp.org
#+begin_export html
---
layout: post
title: "frp"
date: 2019-03-05
categories: 终端工具
tags:
    - 终端工具
    - frp
---
#+end_export

frp 是一个可用于内网穿透的高性能的反向代理应用，支持 tcp, udp 协议，为 http 和 https 应用协议提供了额外的能力，且尝试性支持了点对点穿透。

* 安装 frp

  安装 frp 工具，可以直接访问 [[https://github.com/fatedier/frp][Github]]，下载相应平台的 release 版本。详细配置参考帮助文档。

  frp 支持根据请求的 URL 路径路由转发到不同的后端服务。可以将 ~/client~ 路径设置到另一个 web 服务来同时在本地测试两个服务。

* 配置 frp

  #+begin_src conf
    # frps.ini
    [common]
    bind_port = 7000
    vhost_http_port = 80

    # frpc.ini
    [common]
    server_addr = 47.94.210.246
    server_port = 7000

    [web01]
    type = http
    local_port = 3000
    custom_domains = cas.wozouwokan.com
    locations = /

    [web02]
    type = http
    local_port = 3001
    custom_domains = cas.wozouwokan.com
    locations = /client
  #+end_src

* Refefences

#+begin_quote
> 本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
> 笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
- https://github.com/fatedier/frp
#+end_quote
